app/controllers/comments_controller.rb

INSERT INTO `mt_comment` (`comment_created_on`, `comment_ip`, `comment_visible`, `comment_blog_id`, `comment_junk_log`, `comment_junk_status`, `comment_commenter_id`, `comment_created_by`, `comment_modified_on`, `comment_author`, `comment_url`, `comment_junk_score`, `comment_email`, `comment_modified_by`, `comment_text`, `comment_entry_id`, `comment_last_moved_on`, `comment_parent_id`) VALUES('2009-04-12 08:56:05', NULL, 1, 9, NULL, 1, NULL, NULL, NULL, 'test bru', 'http://headshift.com', 1.0, 'bru@codewitch.org', NULL, 'test test test', 3162, '2000-01-01 00:00:00', NULL)
---
  def create
    comment = Comment.new(params[:comment])
    if current_author
      comment.comment_commenter_id = current_author.id
      comment.created_by = current_author.id