app/controllers/entries_controller.rb

SELECT * FROM `mt_author` WHERE (`mt_author`.`author_id` IN (108,109))
SELECT * FROM `mt_blog` WHERE (blog_site_url LIKE '%/codewitch' or blog_site_url LIKE '%/codewitch/') LIMIT 1
SELECT * FROM `mt_entry` WHERE (`mt_entry`.`entry_blog_id` = 2) ORDER BY entry_authored_on DESC LIMIT 10
SELECT `mt_comment`.* FROM `mt_comment` WHERE (`mt_comment`.comment_entry_id IN (3162,3161,3160,3159,3171,3170,3166,3169,3087,3073))
---
  def index
    @entries = Entry.published.paginate(:page => params[:page], :include => [ :author, :blog, :comments, :tags, :categories ], :conditions => { :entry_blog_id => @blog.id }, :order => "entry_authored_on DESC", :per_page => 10)

SELECT * FROM `mt_tag` WHERE (`mt_tag`.`tag_name` = 'Extraordinary Rendition') LIMIT 1
---
  def tag_search
    @tag = Tag.find(:first, :conditions => { :tag_name => params[:id]})

SELECT * FROM `mt_category` WHERE (`mt_category`.`category_basename` = 'talks') LIMIT 1
---
  def category_archive
    @category = Category.find(:first, :conditions => { :category_basename => params[:category] })

SELECT * FROM `mt_entry` WHERE (entry_blog_id = 9 and entry_basename = 'insight_with_colin_freeman_kidnapped_in_somalia' and year(entry_authored_on) = '2009' and month(entry_authored_on) = '2') LIMIT 1
---
  def entry_archive
    @entry = Entry.published.find(:first, :conditions => ["entry_blog_id = ? and entry_basename = ? and year(entry_authored_on) = ? and month(entry_authored_on) = ?", @blog.id, params[:basename], params[:year], params[:month] ] )

SELECT * FROM `mt_entry` WHERE (entry_blog_id = 9 and year(entry_authored_on) = '2008' and month(entry_authored_on) = '10') ORDER BY entry_authored_on DESC LIMIT 25
---
  def monthly_archive
    @entries = Entry.published.find(:all,
          :conditions => ["entry_blog_id = ? and year(entry_authored_on) = ? and month(entry_authored_on) = ?",
                          @blog.id, params[:year], params[:month] ],
          :order => 'entry_authored_on DESC', :limit => 25 )

SELECT * FROM `mt_blog` WHERE (blog_site_url LIKE '%/justbru' or blog_site_url LIKE '%/justbru/') LIMIT 1
---
  def find_blog
    if params[:blog]
      @blog = Blog.find(params[:blog])